MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_rtc.h
  * @brief   Header file of RTC HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef STM32C5xx_HAL_RTC_H
#define STM32C5xx_HAL_RTC_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_rtc.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

/** @defgroup RTC RTC
  * @{
  */

/** @defgroup RTC_Exported_Types HAL RTC types
  * @{
  */

/* Global exported enumeration ---------------------------------------------------------------------------------------*/
/** @defgroup RTC_Exported_Enums_Config RTC exported global configuration enumerations.
  * @{
  */

/**
  * @brief RTC mode definitions.
  */
typedef enum
{
  HAL_RTC_MODE_BCD    = LL_RTC_BINARY_NONE, /*!< RTC is set to BCD mode only */
  HAL_RTC_MODE_BINARY = LL_RTC_BINARY_ONLY, /*!< RTC is set to binary mode only */
  HAL_RTC_MODE_MIX    = LL_RTC_BINARY_MIX   /*!< RTC is set to mixed mode (BCD and binary mode together) */
} hal_rtc_mode_t;

/**
  * @brief BCD update using the subseconds register (SS) least significant bits.
  *        This mode is also used to feed the wake-up timer based on WUCKSEL[2:0] when
  *        the RTC mode is HAL_RTC_MODE_BINARY or HAL_RTC_MODE_MIX.
  */
typedef enum
{
  HAL_RTC_BCD_UPDATE_8BITS  = LL_RTC_BINARY_MIX_BCDU_0, /*!< Incremented when SS[7:0] = 0 */
  HAL_RTC_BCD_UPDATE_9BITS  = LL_RTC_BINARY_MIX_BCDU_1, /*!< Incremented when SS[8:0] = 0 */
  HAL_RTC_BCD_UPDATE_10BITS = LL_RTC_BINARY_MIX_BCDU_2, /*!< Incremented when SS[9:0] = 0 */
  HAL_RTC_BCD_UPDATE_11BITS = LL_RTC_BINARY_MIX_BCDU_3, /*!< Incremented when SS[10:0] = 0 */
  HAL_RTC_BCD_UPDATE_12BITS = LL_RTC_BINARY_MIX_BCDU_4, /*!< Incremented when SS[11:0] = 0 */
  HAL_RTC_BCD_UPDATE_13BITS = LL_RTC_BINARY_MIX_BCDU_5, /*!< Incremented when SS[12:0] = 0 */
  HAL_RTC_BCD_UPDATE_14BITS = LL_RTC_BINARY_MIX_BCDU_6, /*!< Incremented when SS[13:0] = 0 */
  HAL_RTC_BCD_UPDATE_15BITS = LL_RTC_BINARY_MIX_BCDU_7  /*!< Incremented when SS[14:0] = 0 */
} hal_rtc_bcd_update_t;

/**
  * @}
  */

/** @defgroup RTC_Exported_Enums_Low_Power RTC exported low power configuration enumerations.
  * @{
  */

/**
  * @brief Ultra low power status definitions.
  */
typedef enum
{
  HAL_RTC_ULTRA_LOW_POWER_DISABLED = 0U, /*!< Ultra low power disabled */
  HAL_RTC_ULTRA_LOW_POWER_ENABLED  = 1U  /*!< Ultra low power enabled */
} hal_rtc_ultra_low_power_mode_status_t;

/**
  * @}
  */

/* Calendar exported enumerations ------------------------------------------------------------------------------------*/
/** @defgroup RTC_Exported_Enums_Calendar RTC exported calendar enumerations.
  * @{
  */

/**
  * @brief Hour formats definitions.
  */
typedef enum
{
  HAL_RTC_CALENDAR_HOUR_FORMAT_24   = LL_RTC_HOUR_FORMAT_24HOUR, /*!< 24-hour format */
  HAL_RTC_CALENDAR_HOUR_FORMAT_AMPM = LL_RTC_HOUR_FORMAT_AMPM    /*!< 12-hour format */
} hal_rtc_calendar_hour_format_t;

/**
  * @brief Bypass shadow register definitions.
  */
typedef enum
{
  HAL_RTC_CALENDAR_SHADOW_REG_KEEP   = LL_RTC_SHADOW_REG_KEEP,  /*!< Keep shadow registers */
  HAL_RTC_CALENDAR_SHADOW_REG_BYPASS = LL_RTC_SHADOW_REG_BYPASS /*!< Bypass shadow registers */
} hal_rtc_calendar_shadow_reg_bypass_t;

/**
  * @brief Reference clock definitions.
  */
typedef enum
{
  HAL_RTC_CALENDAR_REF_CLOCK_DISABLED = 0U, /*!< Reference clock disabled */
  HAL_RTC_CALENDAR_REF_CLOCK_ENABLED  = 1U  /*!< Reference clock enabled */
} hal_rtc_calendar_reference_clock_status_t;

/**
  * @brief Summer time definitions.
  */
typedef enum
{
  HAL_RTC_CALENDAR_SUMMER_TIME_DISABLED = 0U, /*!< Summer time disabled */
  HAL_RTC_CALENDAR_SUMMER_TIME_ENABLED  = 1U  /*!< Summer time enabled */
} hal_rtc_calendar_summer_time_status_t;

/**
  * @brief Calendar mode interruption underflow status definitions.
  */
typedef enum
{
  HAL_RTC_CALENDAR_IT_UNDERFLOW_DISABLED = 0U, /*!< Subseconds counter underflow interruption disabled */
  HAL_RTC_CALENDAR_IT_UNDERFLOW_ENABLED  = 1U  /*!< Subseconds counter underflow interruption enabled */
} hal_rtc_calendar_it_underflow_status_t;

/**
  * @}
  */

/* Date and time  exported enumerations ------------------------------------------------------------------------------*/
/** @defgroup RTC_Exported_Enums_Date_Time RTC exported date and time enumerations.
  * @{
  */

/**
  * @brief AM PM definitions.
  */
typedef enum
{
  HAL_RTC_TIME_FORMAT_AM_24H = LL_RTC_TIME_FORMAT_AM_24H, /*!< If 12-hour format, hour is a.m. */
  HAL_RTC_TIME_FORMAT_PM     = LL_RTC_TIME_FORMAT_PM      /*!< Hour is p.m. */
} hal_rtc_time_format_am_pm_t;

/**
  * @brief  Month definitions.
  */
typedef enum
{
  HAL_RTC_MONTH_JANUARY   = LL_RTC_MONTH_JANUARY,   /*!< January */
  HAL_RTC_MONTH_FEBRUARY  = LL_RTC_MONTH_FEBRUARY,  /*!< February */
  HAL_RTC_MONTH_MARCH     = LL_RTC_MONTH_MARCH,     /*!< March */
  HAL_RTC_MONTH_APRIL     = LL_RTC_MONTH_APRIL,     /*!< April */
  HAL_RTC_MONTH_MAY       = LL_RTC_MONTH_MAY,       /*!< May */
  HAL_RTC_MONTH_JUNE      = LL_RTC_MONTH_JUNE,      /*!< June */
  HAL_RTC_MONTH_JULY      = LL_RTC_MONTH_JULY,      /*!< July */
  HAL_RTC_MONTH_AUGUST    = LL_RTC_MONTH_AUGUST,    /*!< August */
  HAL_RTC_MONTH_SEPTEMBER = LL_RTC_MONTH_SEPTEMBER, /*!< September */
  HAL_RTC_MONTH_OCTOBER   = LL_RTC_MONTH_OCTOBER,   /*!< October */
  HAL_RTC_MONTH_NOVEMBER  = LL_RTC_MONTH_NOVEMBER,  /*!< November */
  HAL_RTC_MONTH_DECEMBER  = LL_RTC_MONTH_DECEMBER   /*!< December */
} hal_rtc_month_t;

/**
  * @brief Weekday definitions.
  */
typedef enum
{
  HAL_RTC_WEEKDAY_MONDAY    = LL_RTC_WEEKDAY_MONDAY,    /*!< Monday */
  HAL_RTC_WEEKDAY_TUESDAY   = LL_RTC_WEEKDAY_TUESDAY,   /*!< Tuesday */
  HAL_RTC_WEEKDAY_WEDNESDAY = LL_RTC_WEEKDAY_WEDNESDAY, /*!< Wednesday */
  HAL_RTC_WEEKDAY_THURSDAY  = LL_RTC_WEEKDAY_THURSDAY,  /*!< Thursday */
  HAL_RTC_WEEKDAY_FRIDAY    = LL_RTC_WEEKDAY_FRIDAY,    /*!< Friday */
  HAL_RTC_WEEKDAY_SATURDAY  = LL_RTC_WEEKDAY_SATURDAY,  /*!< Saturday */
  HAL_RTC_WEEKDAY_SUNDAY    = LL_RTC_WEEKDAY_SUNDAY     /*!< Sunday */
} hal_rtc_weekday_t;

/**
  * @}
  */

