MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.h
/** @defgroup RTC_Exported_Enums_Init  RTC exported calendar init enumerations
  * @{
  */

/**
  * @brief RTC calendar initialization status definitions.
  */
typedef enum
{
  HAL_RTC_CALENDAR_NOT_INITIALIZED = 0U, /*!< RTC is not initialized */
  HAL_RTC_CALENDAR_INITIALIZED     = 1U  /*!< RTC is initialized */
} hal_rtc_calendar_status_t;

/**
  * @}
  */

/* Output exported enumerations --------------------------------------------------------------------------------------*/

/** @defgroup RTC_Exported_Enums_Output RTC exported output enumerations
  * @{
  */

/**
  * @brief Tampalarm output polarity definitions.
  */
typedef enum
{
  HAL_RTC_OUTPUT_TAMPALARM_POLARITY_HIGH = LL_RTC_OUTPUTPOLARITY_PIN_HIGH, /*!< Tampalarm output polarity is high */
  HAL_RTC_OUTPUT_TAMPALARM_POLARITY_LOW  = LL_RTC_OUTPUTPOLARITY_PIN_LOW   /*!< Tampalarm output polarity is low */
} hal_rtc_output_tampalarm_polarity_t;

/**
  * @brief  Tampalarm output type definitions.
  *
  */
typedef enum
{
  HAL_RTC_OUTPUT_TAMPALARM_TYPE_PUSHPULL  = LL_RTC_ALARM_OUTPUTTYPE_PUSHPULL,  /*!< Tampalarm output is a push-pull */
  HAL_RTC_OUTPUT_TAMPALARM_TYPE_OPENDRAIN = LL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN, /*!< Tampalarm output is an open-drain */
} hal_rtc_output_tampalarm_type_t;

/**
  * @brief Tampalarm output pull-up definitions.
  */
typedef enum
{
  HAL_RTC_OUTPUT_TAMPALARM_PULLUP_DISABLE = LL_RTC_ALARM_OUTPUT_PULLUP_NONE, /*!< Tampalarm output pull-up disable */
  HAL_RTC_OUTPUT_TAMPALARM_PULLUP_ENABLE  = LL_RTC_ALARM_OUTPUT_PULLUP_ON    /*!< Tampalarm output pull-up enable */
} hal_rtc_output_tampalarm_pullup_t;

/**
  * @brief  Calibration output frequency definitions.
  */
typedef enum
{
  HAL_RTC_OUTPUT_CALIBRATION_SYNCHRONOUS        = LL_RTC_CALIB_FREQUENCY_1HZ,  /*!< 1Hz for RTCCLK at 32768 Hz and prescalers at their default values (PREDIV_A = 127 and PREDIV_S = 255) */
  HAL_RTC_OUTPUT_CALIBRATION_ASYNCHRONOUS_DIV64 = LL_RTC_CALIB_FREQUENCY_512HZ /*!< 512Hz for RTCCLK at 32768 Hz and prescalers at their default values (PREDIV_A = 127 and PREDIV_S = 255) */
} hal_rtc_output_calibration_frequency_t;

/**
  * @brief Output definitions.
  */
typedef enum
{
  HAL_RTC_OUTPUT_OUT1_ALARMA                 = LL_RTC_ALARMOUT_ALARM_A,  /*!< Alarm A event is routed to output 1 */
  HAL_RTC_OUTPUT_OUT1_ALARMB                 = LL_RTC_ALARMOUT_ALARM_B,  /*!< Alarm B event is routed to output 1 */
  HAL_RTC_OUTPUT_OUT1_WAKEUP                 = LL_RTC_ALARMOUT_WAKEUP,  /*!< Wake-up timer event is routed to output 1 */
  HAL_RTC_OUTPUT_OUT1_TAMP                   = LL_RTC_OUTPUT_TAMPER_ENABLE,  /*!< Tamper event is routed to output 1 */
  HAL_RTC_OUTPUT_OUT1_CALIB                  = LL_RTC_CALIB_OUTPUT_ENABLE,  /*!< Calibration is routed to output 1 */
  HAL_RTC_OUTPUT_OUT2_ALARMA                 = (LL_RTC_ALARMOUT_ALARM_A | LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Alarm A event is routed to output 2 */
  HAL_RTC_OUTPUT_OUT2_ALARMB                 = (LL_RTC_ALARMOUT_ALARM_B | LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Alarm B event is routed to output 2 */
  HAL_RTC_OUTPUT_OUT2_WAKEUP                 = (LL_RTC_ALARMOUT_WAKEUP | LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Wake-up timer event is routed to output 2 */
  HAL_RTC_OUTPUT_OUT2_TAMP                   = (LL_RTC_OUTPUT_TAMPER_ENABLE | LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Tamper event is routed to output 2 */
  HAL_RTC_OUTPUT_OUT2_CALIB                  = (LL_RTC_CALIB_OUTPUT_ENABLE | LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Calibration is routed to output 2 */
  HAL_RTC_OUTPUT_OUT1_ALARMA_TAMP            = (LL_RTC_ALARMOUT_ALARM_A | LL_RTC_OUTPUT_TAMPER_ENABLE),  /*!< Alarm A and tamper event are routed to output 1 */
  HAL_RTC_OUTPUT_OUT1_ALARMB_TAMP            = (LL_RTC_ALARMOUT_ALARM_B | LL_RTC_OUTPUT_TAMPER_ENABLE),  /*!< Alarm B and tamper event are routed to output 1 */
  HAL_RTC_OUTPUT_OUT1_WAKEUP_TAMP            = (LL_RTC_ALARMOUT_WAKEUP | LL_RTC_OUTPUT_TAMPER_ENABLE),  /*!< Wake-up timer and tamper event are routed to output 1 */
  HAL_RTC_OUTPUT_OUT2_ALARMA_TAMP            = (LL_RTC_ALARMOUT_ALARM_A | LL_RTC_OUTPUT_TAMPER_ENABLE |
                                                LL_RTC_ALARM_OUTPUT_REMAP_POS1),   /*!< Alarm A and tamper event are routed to output 2 */
  HAL_RTC_OUTPUT_OUT2_ALARMB_TAMP            = (LL_RTC_ALARMOUT_ALARM_B | LL_RTC_OUTPUT_TAMPER_ENABLE |
                                                LL_RTC_ALARM_OUTPUT_REMAP_POS1),   /*!< Alarm B and tamper event are routed to output 2 */
  HAL_RTC_OUTPUT_OUT2_WAKEUP_TAMP            = (LL_RTC_ALARMOUT_WAKEUP | LL_RTC_OUTPUT_TAMPER_ENABLE |
                                                LL_RTC_ALARM_OUTPUT_REMAP_POS1),   /*!< Wake-up timer and tamper event are routed to output 2 */
  HAL_RTC_OUTPUT_OUT1_ALARMA_OUT2_CALIB      = (LL_RTC_ALARMOUT_ALARM_A | LL_RTC_CALIB_OUTPUT_ENABLE |
                                                LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Alarm A event is routed to output 1 and calibration to output 2 */
  HAL_RTC_OUTPUT_OUT1_ALARMB_OUT2_CALIB      = (LL_RTC_ALARMOUT_ALARM_B | LL_RTC_CALIB_OUTPUT_ENABLE |
                                                LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Alarm B event is routed to output 1 and calibration to output 2 */
  HAL_RTC_OUTPUT_OUT1_WAKEUP_OUT2_CALIB      = (LL_RTC_ALARMOUT_WAKEUP | LL_RTC_CALIB_OUTPUT_ENABLE |
                                                LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Wake-up timer event is routed to output 1 and calibration to output 2 */
  HAL_RTC_OUTPUT_OUT1_TAMP_OUT2_CALIB        = (LL_RTC_OUTPUT_TAMPER_ENABLE | LL_RTC_CALIB_OUTPUT_ENABLE |
                                                LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Tamper event is routed to output 1 and calibration to output 2 */
  HAL_RTC_OUTPUT_OUT1_ALARMA_TAMP_OUT2_CALIB = (LL_RTC_ALARMOUT_ALARM_A | LL_RTC_OUTPUT_TAMPER_ENABLE |
                                                LL_RTC_CALIB_OUTPUT_ENABLE | LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Alarm A and tamper event are routed to output 1 and calibration to output 2 */
  HAL_RTC_OUTPUT_OUT1_ALARMB_TAMP_OUT2_CALIB = (LL_RTC_ALARMOUT_ALARM_B | LL_RTC_OUTPUT_TAMPER_ENABLE |
                                                LL_RTC_CALIB_OUTPUT_ENABLE | LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Alarm B and tamper event are routed to output 1 and calibration to output 2 */
  HAL_RTC_OUTPUT_OUT1_WAKEUP_TAMP_OUT2_CALIB = (LL_RTC_ALARMOUT_WAKEUP | LL_RTC_OUTPUT_TAMPER_ENABLE |
                                                LL_RTC_CALIB_OUTPUT_ENABLE | LL_RTC_ALARM_OUTPUT_REMAP_POS1),  /*!< Wake-up timer and tamper event are routed to output 1 and calibration to output 2 */
} hal_rtc_output_t;

/**
  * @brief Output status definitions.
  */
typedef enum
{
  HAL_RTC_OUTPUT_DISABLED = 0U, /*!< Output disabled */
  HAL_RTC_OUTPUT_ENABLED  = 1U  /*!< Output enabled */
} hal_rtc_output_status_t;

/**
  * @}
  */

/* Alarm exported enumerations ---------------------------------------------------------------------------------------*/
/** @defgroup RTC_Exported_Enums_Alarm RTC exported alarm enumerations
  * @{
  */

/**
  * @brief Alarm date weekday definitions.
  */
typedef enum
{
  HAL_RTC_ALARM_DAY_TYPE_SEL_MONTHDAY = LL_RTC_ALMA_DATEWEEKDAYSEL_DATE, /*!< Alarm day corresponds to the month day */
  HAL_RTC_ALARM_DAY_TYPE_SEL_WEEKDAY  = LL_RTC_ALMA_DATEWEEKDAYSEL_WEEKDAY /*!< Alarm day corresponds to the weekday */
} hal_rtc_alarm_day_type_selection_t;

/**
  * Alarm definitions.
  */
typedef enum
{
  HAL_RTC_ALARM_A = LL_RTC_ALARM_A, /*!< Alarm A */
  HAL_RTC_ALARM_B = LL_RTC_ALARM_B  /*!< Alarm B */
} hal_rtc_alarm_t;

/**
  * @brief Alarm flag autoclear definitions.
  */
typedef enum
{
  HAL_ALARM_AUTO_CLEAR_DISABLE = LL_RTC_ALM_AUTOCLR_NO, /*!< Autoclear of the alarm flag is disabled */
  HAL_ALARM_AUTO_CLEAR_ENABLE  = LL_RTC_ALM_AUTOCLR_YES /*!< Autoclear of the alarm flag is enabled */
} hal_rtc_alarm_auto_clear_t;

/**
  * @brief Subseconds register auto-reload on alarm definitions. Enable only in binary mode.
  */
typedef enum
{
  HAL_RTC_ALARM_SUBSECONDS_AUTO_RELOAD_DISABLE = LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_NO, /*!< Disables the autoreload of calendar subseconds register */
  HAL_RTC_ALARM_SUBSECONDS_AUTO_RELOAD_ENABLE = LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_YES  /*!< Enables the autoreload of the subseconds register */
} hal_rtc_alarm_subseconds_auto_reload_t;

/**
  * @}
  */

