MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.h
/* Timestamp exported enumerations -----------------------------------------------------------------------------------*/

/** @defgroup RTC_Exported_Enums_Timestamp RTC exported timestamp enumerations.
  * @{
  */

/**
  * @brief Timestamp event on pin active edge definitions.
  */
typedef enum
{
  HAL_RTC_TIMESTAMP_EDGE_RISING  = LL_RTC_TIMESTAMP_EDGE_RISING, /*!< Create a timestamp event when a rising edge is detected in the input pin */
  HAL_RTC_TIMESTAMP_EDGE_FALLING = LL_RTC_TIMESTAMP_EDGE_FALLING /*!< Create a timestamp event when a falling edge is detected in the input pin */
} hal_rtc_timestamp_source_pin_edge_t;

/**
  * @brief Timestamp interruption status.
  */
typedef enum
{
  HAL_RTC_TIMESTAMP_IT_DISABLED = 0U, /*!< Timestamp interruption disabled */
  HAL_RTC_TIMESTAMP_IT_ENABLED  = 1U  /*!< Timestamp interruption enabled */
} hal_rtc_timestamp_it_status_t;

/**
  * @brief Timestamp on tamper status.
  */
typedef enum
{
  HAL_RTC_TIMESTAMP_TAMPER_DISABLED = 0U, /*!< Timestamp on tamper disabled */
  HAL_RTC_TIMESTAMP_TAMPER_ENABLED  = 1U  /*!< Timestamp on tamper enabled */
} hal_rtc_timestamp_tamper_status_t;


/**
  * @brief Timestamp status.
  */
typedef enum
{
  HAL_RTC_TIMESTAMP_DISABLED = 0U, /*!< Timestamp disabled */
  HAL_RTC_TIMESTAMP_ENABLED  = 1U  /*!< Timestamp enabled */
} hal_rtc_timestamp_status_t;

/**
  * @brief Timestamp event definitions.
  */
typedef enum
{
  HAL_RTC_TIMESTAMP_NO_EVENT       = 0U,               /*!< No timestamp event */
  HAL_RTC_TIMESTAMP_EVENT          = LL_RTC_SR_TSF,    /*!< Timestamp event */
  HAL_RTC_TIMESTAMP_OVERFLOW_EVENT = LL_RTC_SR_TSOVF,  /*!< Timestamp overflow event */
} hal_rtc_timestamp_event_flag_t;


/**
  * @}
  */

/* Wake-up timer exported enumerations -------------------------------------------------------------------------------*/

/** @defgroup RTC_Exported_Enums_WakeUp_Timer RTC exported wake-up timer enumerations.
  * @{
  */

/**
  * @brief Wake-up timer clock definitions.
  */
typedef enum
{
  HAL_RTC_WAKEUP_TIMER_CLOCK_RTCCLK_DIV2   = LL_RTC_WAKEUPCLOCK_DIV_2,  /*!< Wakeup timer clock is the RTCCLK divided by 2 */
  HAL_RTC_WAKEUP_TIMER_CLOCK_RTCCLK_DIV4   = LL_RTC_WAKEUPCLOCK_DIV_4,  /*!< Wakeup timer clock is the RTCCLK divided by 4 */
  HAL_RTC_WAKEUP_TIMER_CLOCK_RTCCLK_DIV8   = LL_RTC_WAKEUPCLOCK_DIV_8,  /*!< Wakeup timer clock is the RTCCLK divided by 8 */
  HAL_RTC_WAKEUP_TIMER_CLOCK_RTCCLK_DIV16  = LL_RTC_WAKEUPCLOCK_DIV_16, /*!< Wakeup timer clock is the RTCCLK divided by 16 */
  HAL_RTC_WAKEUP_TIMER_CLOCK_BCD_UPDATE    = LL_RTC_WAKEUPCLOCK_CKSPRE, /*!< Wakeup timer clock is the BCD update */
  HAL_RTC_WAKEUP_TIMER_CLOCK_BCD_UPDATE_ADD_1BIT = LL_RTC_WAKEUPCLOCK_CKSPRE_WUT /*!< Wakeup timer clock is the BCD update and 1 bit is added to the wakeup timer */
} hal_rtc_wakeup_timer_clock_t;

/**
  * @}
  */

/** @defgroup RTC_Exported_Enums_Calibration RTC exported calibration enumerations.
  * @{
  */

/**
  * @brief Calibration cycle period definitions.
  */
typedef enum
{
  HAL_RTC_CALIBRATION_PERIOD_8SEC  = LL_RTC_CALIB_PERIOD_8SEC,  /*!< Calibration cycle period is set to 8 seconds  */
  HAL_RTC_CALIBRATION_PERIOD_16SEC = LL_RTC_CALIB_PERIOD_16SEC, /*!< Calibration cycle period is set to 16 seconds */
  HAL_RTC_CALIBRATION_PERIOD_32SEC = LL_RTC_CALIB_PERIOD_32SEC  /*!< Calibration cycle period is set to 32 seconds */
} hal_rtc_calibration_period_t;

/**
  * @brief Calibration increase frequency definitions.
  */
typedef enum
{
  HAL_RTC_CALIBRATION_PULSE_NOT_INSERTED = LL_RTC_CALIB_INSERTPULSE_NONE, /*!< No increase of the frequency */
  HAL_RTC_CALIBRATION_PULSE_INSERTED     = LL_RTC_CALIB_INSERTPULSE_SET   /*!< Increase of the frequency by one pulse every 2^11 pulses */
} hal_rtc_calibration_pulse_t;

/**
  * @brief Calibration seconds shifts definitions.
  */
typedef enum
{
  HAL_RTC_CALIBRATION_SHIFT_SECOND_DELAY   = LL_RTC_SHIFT_SECOND_DELAY,  /*!< Delay the calendar by one second */
  HAL_RTC_CALIBRATION_SHIFT_SECOND_ADVANCE = LL_RTC_SHIFT_SECOND_ADVANCE /*!< Advance the calendar by one second */
} hal_rtc_calibration_shift_second_t;

/**
  * @brief Calibration status definitions.
  */
typedef enum
{
  HAL_RTC_CALIBRATION_DISABLED = 0U, /*!< Timestamp disabled */
  HAL_RTC_CALIBRATION_ENABLED  = 1U  /*!< Timestamp enabled */
} hal_rtc_calibration_status_t;

/**
  * @}
  */


/*! HAL RTC Privilege attribute enumeration definition */
typedef enum
{
  HAL_RTC_NPRIV = LL_RTC_ATTR_NPRIV, /*!< RTC Non-privileged attribute */
  HAL_RTC_PRIV  = LL_RTC_ATTR_PRIV   /*!< RTC privileged attribute */
} hal_rtc_priv_attr_t;

/* Exported Unions ---------------------------------------------------------------------------------------------------*/
/** @defgroup RTC_Exported_Unions HAL RTC unions
  * @{
  */

/**
  * @brief RTC Alarm weekday and day union.
  */
typedef union
{
  uint32_t          mday; /*!< Day of the month */
  hal_rtc_weekday_t wday; /*!< Day of the week */
} hal_rtc_alarm_day_t;

/**
  * @}
  */

/* Exported Structure -----------------------------------------------------------------------------------------*/
/** @defgroup RTC_Exported_Structures HAL RTC exported structures
  * @{
  */

/**
  * @brief RTC configuration structure.
  */
typedef struct
{

  hal_rtc_mode_t mode;             /*!< RTC mode */

  uint32_t  asynch_prediv;         /*!< Asynchronous prescaler register value. Real prescaler = asynch_prediv + 1.
                                        This parameter must be a number between 0x00 and 0x7F */

  uint32_t  synch_prediv;          /*!< Synchronous prescaler register value. Real prescaler = synch_prediv + 1.
                                        This parameter must be a number between 0x00 and 0x7FFF.
                                        This parameter is used when the mode is HAL_RTC_MODE_BCD. */

  hal_rtc_bcd_update_t bcd_update; /*!< BCD update. This parameter is when the mode is HAL_RTC_MODE_BINARY or HAL_RTC_MODE_MIX */
} hal_rtc_config_t;

/**
  * @brief  Calendar configuration structure.
  */
typedef struct
{
  hal_rtc_calendar_hour_format_t       hour_format;            /*!< Hour format of the calendar */
  hal_rtc_calendar_shadow_reg_bypass_t bypass_shadow_register; /*!< Keep or bypass the shadow registers */
} hal_rtc_calendar_config_t;

/**
  * @brief Tampalarm polarity output structure.
  */
typedef struct
{
  hal_rtc_output_tampalarm_polarity_t polarity; /*!< Tampalarm output polarity */
  hal_rtc_output_tampalarm_type_t     type;     /*!< Tampalarm output type */
  hal_rtc_output_tampalarm_pullup_t   pullup;   /*!< Tampalarm output pull-up */
} hal_rtc_output_tampalarm_config_t;

/**
  * @brief Calibration output frequency structure.
  */
typedef struct
{
  hal_rtc_output_calibration_frequency_t frequency; /*!< Calibration frequency */
} hal_rtc_output_calib_config_t;

/**
  * @brief Time structure.
  */
typedef struct
{
  hal_rtc_time_format_am_pm_t am_pm;    /*!< Time is a.m. or p.m. */

  uint32_t                    subsec;   /*!< Subseconds register content that can have two functions:
                                             In BCD mode this parameter corresponds to a time unit range between[0-1]
                                             second with [1 sec/(SecondFraction+1)] granularity.
                                             This parameter corresponds to the free-running 32-bit counter in Binary and
                                             Mixed mode.
                                             This field is not used by the @ref HAL_RTC_CALENDAR_SetTime and @ref
                                             HAL_RTC_CALENDAR_SetDateTime functions.
                                             This parameter must be a number between 0x0 and 0x7FFF when configuring the
                                             alarm time in BCD or Mixed mode */

  uint32_t                    microsec; /*!< Time microseconds.
                                             This parameter must be a number between 0 and 999.
                                             It is only used when configuring the wake-up timer time */

  uint32_t                    millisec; /*!< Time milliseconds.
                                             This parameter must be a number between 0 and 999.
                                             It is only used when configuring the wake-up timer time */

  uint32_t                    hour;     /*!< Time hour. This parameter must be a number between:
                                             0 and 12 if the calendar hour format is 12 hours.
                                             0 and 24 if the calendar hour format is 24 hours.
                                             0 and 36 when using it with the wake-up timer */

  uint32_t                    min;      /*!< Time minutes. This parameter must be a number between 0 and 59 */

  uint32_t                    sec;      /*!< Time seconds */
} hal_rtc_time_t;

/**
  * @brief Date structure.
  */
typedef struct
{
  hal_rtc_weekday_t wday; /*!< Weekday */
  hal_rtc_month_t   mon;  /*!< Month */
  uint32_t          mday; /*!< Day. This parameter must be a number between 1 and 31 */
  uint32_t          year; /*!< Year. This parameter must be a number between 0 and 99.
                               Due to register limitations, the year is forced to 0 when reading the timestamp. */
} hal_rtc_date_t;

/**
  * @brief Alarm structure.
  */
typedef struct
{
  hal_rtc_alarm_subseconds_auto_reload_t subsec_auto_reload; /*!< Subsecond register reload. Enable is only allowed in binary mode */
  hal_rtc_alarm_auto_clear_t             auto_clear;         /*!< Alarm event automatic clear by hardware */
} hal_rtc_alarm_config_t;

/**
  * @brief Alarm time structure.
  */
typedef struct
{
  hal_rtc_time_t                     time;                /*!< Time of the alarm */

  uint32_t                           mask;                /*!< Alarm masks.
                                                               This parameter can be a combination of
                                                               @ref RTC_Exported_Constants_Alarm_Mask which includes
                                                               day, hours, minutes and seconds */

  uint32_t                           subsec_mask;         /*!< Alarm subseconds mask.
                                                               The most significant bits starting at this bit
                                                               are masked.
                                                               This parameter must be a number between 0 and 63.
                                                               From 32 to 63 all bits of the subseconds
                                                               register are compared to activate the alarm */

