MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.h
  hal_rtc_alarm_day_type_selection_t mday_wday_selection; /*!< Day mode of the alarm */

  hal_rtc_alarm_day_t                wday_mday;           /*!< Alarm day or day of week */
} hal_rtc_alarm_date_time_t;

/**
  * @brief Timestamp configuration structure.
  */
typedef struct
{
  hal_rtc_timestamp_source_pin_edge_t input_edge_polarity; /*!< Timestamp input edge polarity */
} hal_rtc_timestamp_config_t;

/**
  * @brief Timestamp information structure.
  */
typedef struct
{
  hal_rtc_timestamp_event_flag_t   flag;    /*!< Timestamp flag event   */
} hal_rtc_timestamp_information_t;


/**
  * @brief Wake-up structure.
  */
typedef struct
{
  hal_rtc_wakeup_timer_clock_t clock; /*!< Wake-up timer clock source */
} hal_rtc_wakeup_config_t;

/**
  * @}
  */

/**
  * @}
  */

/* Exported defines --------------------------------------------------------------------------------------------------*/

/** @defgroup RTC_Exported_Constants HAL RTC constants
  * @{
  */

/** @defgroup RTC_Exported_Constants_Alarm_Mask RTC alarm mask defines.
  * @{
  */

#define HAL_RTC_ALARM_MASK_NONE     LL_RTC_ALMA_MASK_NONE         /*!< All day and time values are considered to trigger the alarm */
#define HAL_RTC_ALARM_MASK_DAY      LL_RTC_ALMA_MASK_DATEWEEKDAY  /*!< The day/weekday value is ignored */
#define HAL_RTC_ALARM_MASK_HOURS    LL_RTC_ALMA_MASK_HOURS        /*!< The hour value is ignored */
#define HAL_RTC_ALARM_MASK_MINUTES  LL_RTC_ALMA_MASK_MINUTES      /*!< The minute value is ignored */
#define HAL_RTC_ALARM_MASK_SECONDS  LL_RTC_ALMA_MASK_SECONDS      /*!< The second value is ignored */
#define HAL_RTC_ALARM_MASK_ALL      LL_RTC_ALMA_MASK_ALL          /*!< All day and time values are ignored */

/**
  * @}
  */

/** @defgroup RTC_Exported_Constants_Wakeup_Timer_Interrupts RTC wake-up timer interrupt defines.
  * @{
  */

#define HAL_RTC_WAKEUP_IT_DISABLE LL_RTC_WAKEUP_TIMER_IT_DISABLE /*!< Wake-up interrupts are disabled */
#define HAL_RTC_WAKEUP_IT_ENABLE  LL_RTC_WAKEUP_TIMER_IT_ENABLE  /*!< Wake-up interrupts are enabled */

/**
  * @}
  */

/** @defgroup RTC_Exported_Constants_Alarm_Interrupts RTC alarm interrupt defines.
  * @{
  */

#define HAL_RTC_ALARM_IT_DISABLE LL_RTC_ALMA_IT_DISABLE /*!< Alarm interrupts are disabled */
#define HAL_RTC_ALARM_IT_ENABLE  LL_RTC_ALMA_IT_ENABLE  /*!< Alarm interrupts are enabled */

/**
  * @}
  */


/** @defgroup RTC_privilege_attributes_configuration_items RTC privilege attributes configuration items
  * @{
  */

#define HAL_RTC_PRIV_ITEM_ALRAPRIV LL_RTC_PRIV_ITEM_ALRAPRIV /*!< Privilege attribute of alarm A and underflow protection */
#define HAL_RTC_PRIV_ITEM_ALRBPRIV LL_RTC_PRIV_ITEM_ALRBPRIV /*!< Privilege attribute of alarm B protection */
#define HAL_RTC_PRIV_ITEM_WUTPRIV  LL_RTC_PRIV_ITEM_WUTPRIV  /*!< Privilege attribute of wake-up timer protection */
#define HAL_RTC_PRIV_ITEM_TSPRIV   LL_RTC_PRIV_ITEM_TSPRIV   /*!< Privilege attribute of timestamp protection */
#define HAL_RTC_PRIV_ITEM_CALPRIV  LL_RTC_PRIV_ITEM_CALPRIV  /*!< Privilege attribute of shift register, daylight saving, calibration and reference clock protection  */
#define HAL_RTC_PRIV_ITEM_INITPRIV LL_RTC_PRIV_ITEM_INITPRIV /*!< Privilege attribute of initialization protection */
#define HAL_RTC_PRIV_ITEM_PRIV     LL_RTC_PRIV_ITEM_PRIV     /*!< Privilege attribute of RTC global protection */
#define HAL_RTC_PRIV_ITEM_ALL      LL_RTC_PRIV_ITEM_ALL      /*!< Privilege attribute of all RTC resources */

/**
  * @}
  */


/**
  * @}
  */

/* Exported macros ---------------------------------------------------------------------------------------------------*/

/** @defgroup RTC_Exported_Macros HAL RTC macros
  * @{
  */

/**
  * @brief  Helper macro to convert a value from 2-digit decimal format to BCD format.
  * @param  value Byte to be converted
  * @return Converted byte
  */
#define HAL_RTC_CONVERT_DEC2BCD(value) LL_RTC_CONVERT_BIN2BCD(value)

/**
  * @brief  Helper macro to convert a value from BCD format to 2-digit decimal format.
  * @param  value BCD value to be converted
  * @return Converted byte
  */
#define HAL_RTC_CONVERT_BCD2DEC(value) LL_RTC_CONVERT_BCD2BIN(value)
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup RTC_Exported_Functions HAL RTC functions
  * @{
  */

/** @defgroup RTC_Exported_Functions_Write_Init RTC exported write protection and initialization mode functions.
  * @{
  */
hal_status_t HAL_RTC_EnableWriteProtection(void);
hal_status_t HAL_RTC_DisableWriteProtection(void);

hal_status_t HAL_RTC_EnterInitMode(void);
hal_status_t HAL_RTC_ExitInitMode(void);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Config RTC exported configuration functions
  * @{
  */
hal_status_t HAL_RTC_SetConfig(const hal_rtc_config_t *p_config);
void HAL_RTC_GetConfig(hal_rtc_config_t *p_config);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Low_Power RTC exported low power configuration functions
  * @{
  */
hal_status_t HAL_RTC_EnableUltraLowPowerMode(void);
hal_status_t HAL_RTC_DisableUltraLowPowerMode(void);
hal_rtc_ultra_low_power_mode_status_t HAL_RTC_IsEnabledUltraLowPowerMode(void);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Calendar RTC exported calendar functions
  *  @{
  */
hal_status_t HAL_RTC_CALENDAR_SetConfig(const hal_rtc_calendar_config_t *p_config_calendar);
void HAL_RTC_CALENDAR_GetConfig(hal_rtc_calendar_config_t *p_config_calendar);

hal_status_t HAL_RTC_CALENDAR_SetDateTime(const hal_rtc_date_t *p_date, const hal_rtc_time_t *p_time);
hal_status_t HAL_RTC_CALENDAR_GetDateTime(hal_rtc_date_t *p_date, hal_rtc_time_t *p_time);

hal_status_t HAL_RTC_CALENDAR_SetTime(const hal_rtc_time_t *p_time);
hal_status_t HAL_RTC_CALENDAR_GetTime(hal_rtc_time_t *p_time);

hal_status_t HAL_RTC_CALENDAR_SetDate(const hal_rtc_date_t *p_date);
hal_status_t HAL_RTC_CALENDAR_GetDate(hal_rtc_date_t *p_date);

hal_status_t HAL_RTC_CALENDAR_EnableReferenceClock(void);
hal_status_t HAL_RTC_CALENDAR_DisableReferenceClock(void);

hal_status_t HAL_RTC_CALENDAR_EnableSummerTimeMemorization(void);
hal_status_t HAL_RTC_CALENDAR_DisableSummerTimeMemorization(void);

hal_status_t HAL_RTC_CALENDAR_AddOneHour(void);
hal_status_t HAL_RTC_CALENDAR_SubtractOneHour(void);

uint32_t HAL_RTC_CALENDAR_GetBinaryTime(void);

hal_rtc_calendar_status_t HAL_RTC_CALENDAR_IsInitialized(void);
hal_rtc_calendar_reference_clock_status_t HAL_RTC_CALENDAR_IsEnabledReferenceClock(void);
hal_rtc_calendar_summer_time_status_t HAL_RTC_CALENDAR_IsEnabledSummerTimeMemorization(void);

