MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.h
hal_status_t HAL_RTC_CALENDAR_EnableITSubSecondsUnderflow(void);
hal_status_t HAL_RTC_CALENDAR_DisableITSubSecondsUnderflow(void);
hal_rtc_calendar_it_underflow_status_t HAL_RTC_CALENDAR_IsEnabledITSubSecondsUnderflow(void);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Output RTC exported output functions
  * @{
  */
hal_status_t HAL_RTC_OUTPUT_SetConfigTampalarm(const hal_rtc_output_tampalarm_config_t *p_config);
void HAL_RTC_OUTPUT_GetConfigTampalarm(hal_rtc_output_tampalarm_config_t *p_config);

hal_status_t HAL_RTC_OUTPUT_SetConfigCalib(const hal_rtc_output_calib_config_t *p_config);
void HAL_RTC_OUTPUT_GetConfigCalib(hal_rtc_output_calib_config_t *p_config);

hal_status_t HAL_RTC_OUTPUT_Enable(hal_rtc_output_t output);
hal_status_t HAL_RTC_OUTPUT_Disable(void);
hal_rtc_output_status_t HAL_RTC_OUTPUT_IsEnabled(hal_rtc_output_t output);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Calibration RTC exported calibration functions
  * @{
  */
hal_status_t HAL_RTC_EnableCalibration(hal_rtc_calibration_period_t calibration_period,
                                       hal_rtc_calibration_pulse_t pulse_add,
                                       uint32_t subtracted_pulses);
hal_status_t HAL_RTC_DisableCalibration(void);
hal_rtc_calibration_status_t HAL_RTC_IsEnabledCalibration(void);

hal_status_t HAL_RTC_ShiftCalibration(hal_rtc_calibration_shift_second_t add_one_sec,
                                      uint32_t fraction_sec_to_subtract);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Alarms RTC exported alarm functions
  * @{
  */
hal_status_t HAL_RTC_ALARM_SetConfig(hal_rtc_alarm_t alarm, const hal_rtc_alarm_config_t *p_config_alarm);
void HAL_RTC_ALARM_GetConfig(hal_rtc_alarm_t alarm, hal_rtc_alarm_config_t *p_config_alarm);

hal_status_t HAL_RTC_ALARM_SetDateTime(hal_rtc_alarm_t alarm, const hal_rtc_alarm_date_time_t *p_date_time);
void HAL_RTC_ALARM_GetDateTime(hal_rtc_alarm_t alarm, hal_rtc_alarm_date_time_t *p_date_time);

hal_status_t HAL_RTC_ALARM_Start(hal_rtc_alarm_t alarm, uint32_t interruption);
hal_status_t HAL_RTC_ALARM_Stop(hal_rtc_alarm_t alarm);
hal_status_t HAL_RTC_ALARM_PollForEvent(hal_rtc_alarm_t alarm, uint32_t timeout_ms);

hal_status_t HAL_RTC_ALARM_SetBinaryTime(hal_rtc_alarm_t alarm, uint32_t alarm_subsecond);
uint32_t HAL_RTC_ALARM_GetBinaryTime(hal_rtc_alarm_t alarm);
hal_status_t HAL_RTC_ALARM_SetBinarySubSecondMask(hal_rtc_alarm_t alarm, uint32_t alarm_subsecond_mask);
uint32_t HAL_RTC_ALARM_GetBinarySubSecondMask(hal_rtc_alarm_t alarm);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Timestamp RTC exported timestamp functions
  * @{
  */
hal_status_t HAL_RTC_TIMESTAMP_SetConfig(const hal_rtc_timestamp_config_t *p_config_timestamp);
void HAL_RTC_TIMESTAMP_GetConfig(hal_rtc_timestamp_config_t *p_config_timestamp);
hal_status_t HAL_RTC_TIMESTAMP_EnablePinSource(void);
hal_status_t HAL_RTC_TIMESTAMP_DisablePinSource(void);
hal_rtc_timestamp_status_t HAL_RTC_TIMESTAMP_IsEnabledPinSource(void);

hal_status_t HAL_RTC_TIMESTAMP_EnableTamperSource(void);
hal_status_t HAL_RTC_TIMESTAMP_DisableTamperSource(void);
hal_rtc_timestamp_tamper_status_t HAL_RTC_TIMESTAMP_IsEnabledTamperSource(void);

hal_status_t HAL_RTC_TIMESTAMP_EnableIT(void);
hal_status_t HAL_RTC_TIMESTAMP_DisableIT(void);
hal_rtc_timestamp_it_status_t HAL_RTC_TIMESTAMP_IsEnabledIT(void);

hal_status_t HAL_RTC_TIMESTAMP_GetDateTime(hal_rtc_time_t *p_time, hal_rtc_date_t *p_date,
                                           hal_rtc_timestamp_information_t *p_info);

hal_status_t HAL_RTC_TIMESTAMP_PollForEvent(uint32_t timeout_ms);

hal_status_t HAL_RTC_TIMESTAMP_GetBinaryTime(uint32_t *p_time_subseconds, hal_rtc_timestamp_information_t *p_info);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_WakeUp_Timer RTC exported wake-up timer functions
  * @{
  */
hal_status_t HAL_RTC_WAKEUP_SetConfig(const hal_rtc_wakeup_config_t *p_config_wakeup_timer);
void HAL_RTC_WAKEUP_GetConfig(hal_rtc_wakeup_config_t *p_config_wakeup_timer);

hal_status_t HAL_RTC_WAKEUP_SetPeriod(const hal_rtc_time_t *p_auto_reload_time,
                                      const hal_rtc_time_t *p_auto_clear_time);
void HAL_RTC_WAKEUP_GetPeriod(hal_rtc_time_t *p_auto_reload_time,
                              hal_rtc_time_t *p_auto_clear_time);

hal_status_t HAL_RTC_WAKEUP_Start(uint32_t interruption);
hal_status_t HAL_RTC_WAKEUP_Stop(void);
hal_status_t HAL_RTC_WAKEUP_PollForEvent(uint32_t timeout_ms);

hal_status_t HAL_RTC_WAKEUP_SetAutoReloadAndAutoClear(uint32_t wakeup_timer_auto_reload,
                                                      uint32_t wakeup_timer_auto_clear);
uint32_t HAL_RTC_WAKEUP_GetAutoReload(void);
uint32_t HAL_RTC_WAKEUP_GetAutoClear(void);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_IRQ RTC exported IRQ functions
  * @{
  */
void HAL_RTC_IRQHandler(void);
void HAL_RTC_ALARM_IRQHandler(void);
void HAL_RTC_TIMESTAMP_IRQHandler(void);
void HAL_RTC_WAKEUP_IRQHandler(void);
void HAL_RTC_SubSecondsUnderflow_IRQHandler(void);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Callback RTC exported callback functions
  * @{
  */
void HAL_RTC_AlarmAEventCallback(void);
void HAL_RTC_AlarmBEventCallback(void);
void HAL_RTC_TimestampEventCallback(void);
void HAL_RTC_WakeUpTimerEventCallback(void);
void HAL_RTC_SubSecondsUnderflowEventCallback(void);
/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Attributes RTC exported attribute management functions
  * @{
  */

hal_status_t HAL_RTC_SetPrivAttr(uint32_t item, hal_rtc_priv_attr_t priv_attr);
hal_rtc_priv_attr_t HAL_RTC_GetPrivAttr(uint32_t item);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5xx_HAL_RTC_H */
